var addressInit = function(_cmbProvince, _cmbCity, _cmbArea, defaultProvince, defaultCity, defaultArea)
{
	var cmbProvince = document.getElementById(_cmbProvince);
	var cmbCity = document.getElementById(_cmbCity);
	var cmbArea = document.getElementById(_cmbArea);
	
	function cmbSelect(cmb, str)
	{
		for(var i=0; i<cmb.options.length; i++)
		{
			if(cmb.options[i].value == str)
			{
				cmb.selectedIndex = i;
				return;
			}
		}
	}
	function cmbAddOption(cmb, str, obj)
	{
		var option = document.createElement("OPTION");
		cmb.options.add(option);
		option.innerHTML = str;
		option.value = str;
		option.obj = obj;
	}
	
	function changeCity()
	{
		cmbArea.options.length = 0;
		if(cmbCity.selectedIndex == -1)return;
		var item = cmbCity.options[cmbCity.selectedIndex].obj;
		for(var i=0; i<item.areaList.length; i++)
		{
			cmbAddOption(cmbArea, item.areaList[i], null);
		}
		cmbSelect(cmbArea, defaultArea);
	}
	function changeProvince()
	{
		cmbCity.options.length = 0;
		cmbCity.onchange = null;
		if(cmbProvince.selectedIndex == -1)return;
		var item = cmbProvince.options[cmbProvince.selectedIndex].obj;
		for(var i=0; i<item.cityList.length; i++)
		{
			cmbAddOption(cmbCity, item.cityList[i].name, item.cityList[i]);
		}
		cmbSelect(cmbCity, defaultCity);
		changeCity();
		cmbCity.onchange = changeCity;
	}
	
	for(var i=0; i<provinceList.length; i++)
	{
		cmbAddOption(cmbProvince, provinceList[i].name, provinceList[i]);
	}
	cmbSelect(cmbProvince, defaultProvince);
	changeProvince();
	cmbProvince.onchange = changeProvince;
}

var provinceList = [
{name:'请选择省', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'请选择市', areaList:['请选择县','请选择县']}
]},
{name:'北京', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'北京', areaList:['请选择县','市辖区','海淀','朝阳','顺义','怀柔','通州','昌平','延庆','丰台','石景山','大兴','房山','密云','门头沟','平谷']}
]},
{name:'上海', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'上海', areaList:['请选择县','市辖区','闵行','宝山','嘉定','浦东南汇','金山','青浦','松江','奉贤','崇明','徐家汇','浦东']}
]},
{name:'天津', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'天津', areaList:['请选择县','市辖区','武清','宝坻','东丽','西青','北辰','宁河','汉沽','静海','津南','塘沽','大港','蓟县']}
]},
{name:'重庆', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'重庆', areaList:['请选择县','市辖区','永川','合川','南川','江津','万盛','渝北','北碚','巴南','长寿','黔江','万州','涪陵','开县','城口','云阳','巫溪','奉节','巫山','潼南','垫江','梁平','忠县','石柱','大足','荣昌','铜梁','璧山','丰都','武隆','彭水','綦江','酉阳','秀山']}
]},
{name:'香港', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'香港', areaList:['请选择县','市辖区','九龙','新界']}
]},
{name:'澳门', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'澳门', areaList:['请选择县','市辖区','氹仔岛','路环岛']}
]},
{name:'台湾', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'台北', areaList:['请选择县','市辖区','桃园','新竹','宜兰']},
{name:'高雄', areaList:['请选择县','市辖区','嘉义','台南','台东','屏东']},
{name:'台中', areaList:['请选择县','市辖区','苗栗','彰化','南投','花莲','云林']}
]},
{name:'黑龙江', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'哈尔滨', areaList:['请选择县','市辖区','双城','呼兰','阿城','宾县','依兰','巴彦','通河','方正','延寿','尚志','五常','木兰']},
{name:'齐齐哈尔', areaList:['请选择县','市辖区','讷河','龙江','甘南','富裕','依安','拜泉','克山','克东','泰来']},
{name:'牡丹江', areaList:['请选择县','市辖区','海林','穆棱','林口','绥芬河','宁安','东宁']},
{name:'佳木斯', areaList:['请选择县','市辖区','汤原','抚远','桦川','桦南','同江','富锦']},
{name:'绥化', areaList:['请选择县','市辖区','肇东','安达','海伦','明水','望奎','兰西','青冈','庆安','绥棱']},
{name:'黑河', areaList:['请选择县','市辖区','嫩江','孙吴','逊克','五大连池','北安']},
{name:'大兴安岭', areaList:['请选择县','市辖区','塔河','漠河','呼玛','呼中','新林','加格达奇']},
{name:'伊春', areaList:['请选择县','市辖区','乌伊岭','五营','铁力','嘉荫']},
{name:'大庆', areaList:['请选择县','市辖区','林甸','肇州','肇源','杜尔伯特']},
{name:'七台河', areaList:['请选择县','市辖区','勃利']},
{name:'鸡西', areaList:['请选择县','市辖区','虎林','密山','鸡东']},
{name:'鹤岗', areaList:['请选择县','市辖区','绥滨','萝北']},
{name:'双鸭山', areaList:['请选择县','市辖区','集贤','宝清','饶河','友谊']}
]},
{name:'吉林', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'长春', areaList:['请选择县','市辖区','农安','德惠','九台','榆树','双阳']},
{name:'吉林', areaList:['请选择县','市辖区','舒兰','永吉','蛟河','磐石','桦甸']},
{name:'延边', areaList:['请选择县','延吉','敦化','安图','汪清','和龙','龙井','珲春','图们']},
{name:'四平', areaList:['请选择县','市辖区','双辽','梨树','公主岭','伊通']},
{name:'通化', areaList:['请选择县','市辖区','梅河口','柳河','辉南','集安','通化县']},
{name:'白城', areaList:['请选择县','市辖区','洮南','大安','镇赉','通榆']},
{name:'辽源', areaList:['请选择县','市辖区','东丰','东辽']},
{name:'松原', areaList:['请选择县','市辖区','乾安','前郭','长岭','扶余']},
{name:'白山', areaList:['请选择县','市辖区','靖宇','临江','东岗','长白','抚松','江源']}
]},
{name:'辽宁', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'沈阳', areaList:['请选择县','市辖区','辽中','康平','法库','新民']},
{name:'大连', areaList:['请选择县','市辖区','瓦房店','金州','普兰店','旅顺','长海','庄河']},
{name:'鞍山', areaList:['请选择县','市辖区','台安','岫岩','海城']},
{name:'抚顺', areaList:['请选择县','市辖区','新宾','清原','章党']},
{name:'本溪', areaList:['请选择县','市辖区','本溪县','桓仁']},
{name:'丹东', areaList:['请选择县','市辖区','凤城','宽甸','东港']},
{name:'锦州', areaList:['请选择县','市辖区','凌海','义县','黑山','北镇']},
{name:'营口', areaList:['请选择县','市辖区','大石桥','盖州']},
{name:'阜新', areaList:['请选择县','市辖区','彰武']},
{name:'辽阳', areaList:['请选择县','市辖区','辽阳县','灯塔','弓长岭']},
{name:'铁岭', areaList:['请选择县','市辖区','开原','昌图','西丰','调兵山']},
{name:'朝阳', areaList:['请选择县','市辖区','凌源','喀左','北票','建平县']},
{name:'盘锦', areaList:['请选择县','市辖区','大洼','盘山']},
{name:'葫芦岛', areaList:['请选择县','市辖区','建昌','绥中','兴城']}
]},
{name:'内蒙古', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'呼和浩特', areaList:['请选择县','市辖区','土左旗','托县','和林','清水河','呼市郊区','武川']},
{name:'包头', areaList:['请选择县','市辖区','白云鄂博','满都拉','土右旗','固阳','达茂旗','希拉穆仁']},
{name:'乌海', areaList:['请选择县','市辖区']},
{name:'乌兰察布', areaList:['请选择县','集宁','卓资','化德','商都','兴和','凉城','察右前旗','察右中旗','察右后旗','四子王旗','丰镇']},
{name:'通辽', areaList:['请选择县','市辖区','舍伯吐','科左中旗','科左后旗','青龙山','开鲁','库伦','奈曼','扎鲁特','巴雅尔吐胡硕','霍林郭勒']},
{name:'赤峰', areaList:['请选择县','市辖区','阿鲁旗','浩尔吐','巴林左旗','巴林右旗','林西','克什克腾','翁牛特','岗子','喀喇沁','八里罕','宁城','敖汉','宝国吐']},
{name:'鄂尔多斯', areaList:['请选择县','市辖区','达拉特','准格尔','鄂前旗','河南','伊克乌素','鄂托克','杭锦旗','乌审旗','伊金霍洛','乌审召','东胜']},
{name:'巴彦淖尔', areaList:['请选择县','临河','五原','磴口','乌前旗','大佘太','乌中旗','乌后旗','海力素','那仁宝力格','杭锦后旗']},
{name:'锡林郭勒', areaList:['请选择县','锡林浩特','二连浩特','阿巴嘎','苏左旗','苏右旗','朱日和','东乌旗','西乌旗','太仆寺','镶黄旗','正镶白旗','正蓝旗','多伦','博克图','乌拉盖']},
{name:'呼伦贝尔', areaList:['请选择县','海拉尔','小二沟','阿荣旗','莫力达瓦','鄂伦春旗','鄂温克旗','陈旗','新左旗','新右旗','满洲里','牙克石','扎兰屯','额尔古纳','根河','图里河']},
{name:'乌兰浩特', areaList:['请选择县','市辖区','高力板','阿尔山','科右中旗','胡尔勒','扎赉特','索伦','突泉','科右前旗']},
{name:'阿拉善盟', areaList:['请选择县','阿左旗','阿右旗','额济纳','拐子湖','吉兰太','锡林高勒','头道湖','中泉子','诺尔公','雅布赖','乌斯泰','孪井滩']}
]},
{name:'河北', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'石家庄', areaList:['请选择县','市辖区','井陉','正定','栾城','行唐','灵寿','高邑','深泽','赞皇','无极','平山','元氏','赵县','辛集','藁城','晋州','新乐','鹿泉']},
{name:'保定', areaList:['请选择县','市辖区','满城','阜平','徐水','唐县','高阳','容城','涞源','望都','安新','易县','曲阳','蠡县','顺平','雄县','涿州','定州','安国','高碑店','涞水','定兴','清苑','博野']},
{name:'张家口', areaList:['请选择县','市辖区','宣化','张北','康保','沽源','尚义','蔚县','阳原','怀安','万全','怀来','涿鹿','赤城','崇礼']},
{name:'承德', areaList:['请选择县','市辖区','承德县','兴隆','平泉','滦平','隆化','丰宁','宽城','围场']},
{name:'唐山', areaList:['请选择县','市辖区','丰南','丰润','滦县','滦南','乐亭','迁西','玉田','唐海','遵化','迁安','曹妃甸']},
{name:'廊坊', areaList:['请选择县','市辖区','固安','永清','香河','大城','文安','大厂','霸州','三河']},
{name:'沧州', areaList:['请选择县','市辖区','青县','东光','海兴','盐山','肃宁','南皮','吴桥','献县','孟村','泊头','任丘','黄骅','河间','沧县']},
{name:'衡水', areaList:['请选择县','市辖区','枣强','武邑','武强','饶阳','安平','故城','景县','阜城','冀州','深州']},
{name:'邢台', areaList:['请选择县','市辖区','临城','内丘','柏乡','隆尧','南和','宁晋','巨鹿','新河','广宗','平乡','威县','清河','临西','南宫','沙河','任县']},
{name:'邯郸', areaList:['请选择县','市辖区','峰峰','临漳','成安','大名','涉县','磁县','肥乡','永年','邱县','鸡泽','广平','馆陶','魏县','曲周','武安']},
{name:'秦皇岛', areaList:['请选择县','市辖区','青龙','昌黎','抚宁','卢龙','北戴河']}
]},
{name:'河南', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'郑州', areaList:['请选择县','市辖区','巩义','荥阳','登封','新密','新郑','中牟','上街']},
{name:'安阳', areaList:['请选择县','市辖区','汤阴','滑县','内黄','林州']},
{name:'新乡', areaList:['请选择县','市辖区','获嘉','原阳','辉县','卫辉','延津','封丘','长垣']},
{name:'许昌', areaList:['请选择县','市辖区','鄢陵','襄城','长葛','禹州']},
{name:'平顶山', areaList:['请选择县','市辖区','郏县','宝丰','汝州','叶县','舞钢','鲁山','石龙']},
{name:'信阳', areaList:['请选择县','市辖区','息县','罗山','光山','新县','淮滨','潢川','固始','商城']},
{name:'南阳', areaList:['请选择县','市辖区','南召','方城','社旗','西峡','内乡','镇平','淅川','新野','唐河','邓州','桐柏']},
{name:'开封', areaList:['请选择县','市辖区','杞县','尉氏','通许','兰考']},
{name:'洛阳', areaList:['请选择县','市辖区','新安','孟津','宜阳','洛宁','伊川','嵩县','偃师','栾川','汝阳','吉利']},
{name:'商丘', areaList:['请选择县','市辖区','睢县','民权','虞城','柘城','宁陵','夏邑','永城']},
{name:'焦作', areaList:['请选择县','市辖区','修武','武陟','沁阳','博爱','温县','孟州']},
{name:'鹤壁', areaList:['请选择县','市辖区','浚县','淇县']},
{name:'濮阳', areaList:['请选择县','市辖区','台前','南乐','清丰','范县']},
{name:'周口', areaList:['请选择县','市辖区','扶沟','太康','淮阳','西华','商水','项城','郸城','鹿邑','沈丘']},
{name:'漯河', areaList:['请选择县','市辖区','临颍','舞阳']},
{name:'驻马店', areaList:['请选择县','市辖区','西平','遂平','上蔡','汝南','泌阳','平舆','新蔡','确山','正阳']},
{name:'三门峡', areaList:['请选择县','市辖区','灵宝','渑池','卢氏','义马','陕县']},
{name:'济源', areaList:['请选择县','市辖区']}
]},
{name:'山西', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'太原', areaList:['请选择县','市辖区','清徐','阳曲','娄烦','古交','尖草坪区','小店区']},
{name:'大同', areaList:['请选择县','市辖区','阳高','大同县','天镇','广灵','灵丘','浑源','左云']},
{name:'阳泉', areaList:['请选择县','市辖区','盂县','平定']},
{name:'晋中', areaList:['请选择县','市辖区','榆次','榆社','左权','和顺','昔阳','寿阳','太谷','祁县','平遥','灵石','介休']},
{name:'长治', areaList:['请选择县','市辖区','黎城','屯留','潞城','襄垣','平顺','武乡','沁县','长子','沁源','壶关']},
{name:'晋城', areaList:['请选择县','市辖区','沁水','阳城','陵川','高平','泽州']},
{name:'临汾', areaList:['请选择县','市辖区','曲沃','永和','隰县','大宁','吉县','襄汾','蒲县','汾西','洪洞','霍州','乡宁','翼城','侯马','浮山','安泽','古县']},
{name:'运城', areaList:['请选择县','市辖区','临猗','稷山','万荣','河津','新绛','绛县','闻喜','垣曲','永济','芮城','夏县','平陆']},
{name:'朔州', areaList:['请选择县','市辖区','平鲁','山阴','右玉','应县','怀仁']},
{name:'忻州', areaList:['请选择县','市辖区','定襄','五台县','河曲','偏关','神池','宁武','代县','繁峙','五台山','保德','静乐','岢岚','五寨','原平']},
{name:'吕梁', areaList:['请选择县','市辖区','离石','临县','兴县','岚县','柳林','石楼','方山','交口','中阳','孝义','汾阳','文水','交城']}
]},
{name:'山东', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'济南', areaList:['请选择县','市辖区','长清','商河','章丘','平阴','济阳']},
{name:'青岛', areaList:['请选择县','市辖区','崂山','即墨','胶州','黄岛','莱西','平度']},
{name:'淄博', areaList:['请选择县','市辖区','淄川','博山','高青','周村','沂源','桓台','临淄']},
{name:'德州', areaList:['请选择县','市辖区','武城','临邑','陵县','齐河','乐陵','庆云','平原','宁津','夏津','禹城']},
{name:'烟台', areaList:['请选择县','市辖区','莱州','长岛','蓬莱','龙口','招远','栖霞','福山','牟平','莱阳','海阳']},
{name:'潍坊', areaList:['请选择县','市辖区','青州','寿光','临朐','昌乐','昌邑','安丘','高密','诸城']},
{name:'济宁', areaList:['请选择县','市辖区','嘉祥','微山','鱼台','兖州','金乡','汶上','泗水','梁山','曲阜','邹城']},
{name:'泰安', areaList:['请选择县','市辖区','新泰','肥城','东平','宁阳']},
{name:'临沂', areaList:['请选择县','市辖区','莒南','沂南','兰陵','临沭','郯城','蒙阴','平邑','费县','沂水']},
{name:'菏泽', areaList:['请选择县','市辖区','鄄城','郓城','东明','定陶','巨野','曹县','成武','单县']},
{name:'滨州', areaList:['请选择县','市辖区','博兴','无棣','阳信','惠民','沾化','邹平']},
{name:'东营', areaList:['请选择县','市辖区','河口','垦利','利津','广饶']},
{name:'威海', areaList:['请选择县','市辖区','文登','荣成','乳山','成山头','石岛']},
{name:'枣庄', areaList:['请选择县','市辖区','薛城','峄城','台儿庄','滕州']},
{name:'日照', areaList:['请选择县','市辖区','五莲','莒县']},
{name:'莱芜', areaList:['请选择县','市辖区']},
{name:'聊城', areaList:['请选择县','市辖区','冠县','阳谷','高唐','茌平','东阿','临清','莘县']}
]},
{name:'江苏', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'南京', areaList:['请选择县','市辖区','溧水','高淳','江宁','六合','江浦','浦口']},
{name:'无锡', areaList:['请选择县','市辖区','江阴','宜兴','锡山']},
{name:'镇江', areaList:['请选择县','市辖区','丹阳','扬中','句容','丹徒']},
{name:'苏州', areaList:['请选择县','市辖区','常熟','张家港','昆山','吴中','吴江','太仓']},
{name:'南通', areaList:['请选择县','市辖区','海安','如皋','如东','启东','海门','通州']},
{name:'扬州', areaList:['请选择县','市辖区','宝应','仪征','高邮','江都','邗江']},
{name:'盐城', areaList:['请选择县','市辖区','响水','滨海','阜宁','射阳','建湖','东台','大丰','盐都']},
{name:'徐州', areaList:['请选择县','市辖区','铜山','丰县','沛县','邳州','睢宁','新沂']},
{name:'淮安', areaList:['请选择县','市辖区','金湖','盱眙','洪泽','涟水','淮阴区','淮安区']},
{name:'连云港', areaList:['请选择县','市辖区','东海','赣榆','灌云','灌南']},
{name:'常州', areaList:['请选择县','市辖区','溧阳','金坛','武进']},
{name:'泰州', areaList:['请选择县','市辖区','兴化','泰兴','姜堰','靖江']},
{name:'宿迁', areaList:['请选择县','市辖区','沭阳','泗阳','泗洪','宿豫']}
]},
{name:'浙江', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'杭州', areaList:['请选择县','市辖区','萧山','桐庐','淳安','建德','余杭','临安','富阳']},
{name:'湖州', areaList:['请选择县','市辖区','长兴','安吉','德清']},
{name:'嘉兴', areaList:['请选择县','市辖区','嘉善','海宁','桐乡','平湖','海盐']},
{name:'宁波', areaList:['请选择县','市辖区','慈溪','余姚','奉化','象山','宁海','北仑','鄞州','镇海']},
{name:'绍兴', areaList:['请选择县','市辖区','诸暨','上虞','新昌','嵊州']},
{name:'台州', areaList:['请选择县','市辖区','玉环','三门','天台','仙居','温岭','洪家','临海','椒江','黄岩','路桥']},
{name:'温州', areaList:['请选择县','市辖区','泰顺','文成','平阳','瑞安','洞头','乐清','永嘉','苍南']},
{name:'丽水', areaList:['请选择县','市辖区','遂昌','龙泉','缙云','青田','云和','庆元','松阳','景宁']},
{name:'金华', areaList:['请选择县','市辖区','浦江','兰溪','义乌','东阳','武义','永康','磐安']},
{name:'衢州', areaList:['请选择县','市辖区','常山','开化','龙游','江山','衢江']},
{name:'舟山', areaList:['请选择县','市辖区','嵊泗','岱山','普陀','定海']}
]},
{name:'福建', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'福州', areaList:['请选择县','市辖区','闽清','闽侯','罗源','连江','永泰','平潭','长乐','福清','钓鱼岛']},
{name:'厦门', areaList:['请选择县','市辖区','同安']},
{name:'宁德', areaList:['请选择县','市辖区','古田','霞浦','寿宁','周宁','福安','柘荣','福鼎','屏南']},
{name:'莆田', areaList:['请选择县','市辖区','仙游','秀屿港','涵江','秀屿','荔城','城厢']},
{name:'泉州', areaList:['请选择县','市辖区','安溪','永春','德化','南安','崇武','惠安','晋江','石狮']},
{name:'漳州', areaList:['请选择县','市辖区','长泰','南靖','平和','龙海','漳浦','诏安','东山','云霄','华安']},
{name:'龙岩', areaList:['请选择县','市辖区','长汀','连城','武平','上杭','永定','漳平']},
{name:'三明', areaList:['请选择县','市辖区','宁化','清流','泰宁','将乐','建宁','明溪','沙县','尤溪','永安','大田']},
{name:'南平', areaList:['请选择县','市辖区','顺昌','光泽','邵武','武夷山','浦城','建阳','松溪','政和','建瓯']}
]},
{name:'江西', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'南昌', areaList:['请选择县','市辖区','新建','南昌县','安义','进贤']},
{name:'九江', areaList:['请选择县','市辖区','瑞昌','庐山','武宁','德安','永修','湖口','彭泽','星子','都昌','修水']},
{name:'上饶', areaList:['请选择县','市辖区','鄱阳','婺源','余干','万年','德兴','上饶县','弋阳','横峰','铅山','玉山','广丰']},
{name:'抚州', areaList:['请选择县','市辖区','广昌','乐安','崇仁','金溪','资溪','宜黄','南城','南丰','黎川','东乡']},
{name:'宜春', areaList:['请选择县','市辖区','铜鼓','宜丰','万载','上高','靖安','奉新','高安','樟树','丰城']},
{name:'吉安', areaList:['请选择县','市辖区','吉安县','吉水','新干','峡江','永丰','永新','井冈山','万安','遂川','泰和','安福','宁冈']},
{name:'赣州', areaList:['请选择县','市辖区','崇义','上犹','南康','大余','信丰','宁都','石城','瑞金','于都','会昌','安远','全南','龙南','定南','寻乌','兴国','赣县']},
{name:'景德镇', areaList:['请选择县','市辖区','乐平','浮梁']},
{name:'萍乡', areaList:['请选择县','市辖区','莲花','上栗','安源','芦溪','湘东']},
{name:'新余', areaList:['请选择县','市辖区','分宜']},
{name:'鹰潭', areaList:['请选择县','市辖区','余江','贵溪']}
]},
{name:'安徽', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'合肥', areaList:['请选择县','市辖区','长丰','肥东','肥西','巢湖','庐江']},
{name:'蚌埠', areaList:['请选择县','市辖区','怀远','固镇','五河']},
{name:'芜湖', areaList:['请选择县','市辖区','繁昌','芜湖县','南陵','无为']},
{name:'淮南', areaList:['请选择县','市辖区','凤台','潘集']},
{name:'马鞍山', areaList:['请选择县','市辖区','当涂','含山','和县']},
{name:'安庆', areaList:['请选择县','市辖区','枞阳','太湖','潜山','怀宁','宿松','望江','岳西','桐城']},
{name:'宿州', areaList:['请选择县','市辖区','砀山','灵璧','泗县','萧县']},
{name:'阜阳', areaList:['请选择县','市辖区','阜南','颍上','临泉','界首','太和']},
{name:'亳州', areaList:['请选择县','市辖区','涡阳','利辛','蒙城']},
{name:'黄山', areaList:['请选择县','市辖区','黄山区','屯溪','祁门','黟县','歙县','休宁','风景区']},
{name:'滁州', areaList:['请选择县','市辖区','凤阳','明光','定远','全椒','来安','天长']},
{name:'淮北', areaList:['请选择县','市辖区','濉溪']},
{name:'铜陵', areaList:['请选择县','市辖区']},
{name:'宣城', areaList:['请选择县','市辖区','泾县','旌德','宁国','绩溪','广德','郎溪']},
{name:'六安', areaList:['请选择县','市辖区','霍邱','寿县','金寨','霍山','舒城']},
{name:'池州', areaList:['请选择县','市辖区','东至','青阳','九华山','石台']}
]},
{name:'湖北', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'武汉', areaList:['请选择县','市辖区','蔡甸','黄陂','新洲','江夏','东西湖']},
{name:'襄阳', areaList:['请选择县','市辖区','襄州','保康','南漳','宜城','老河口','谷城','枣阳']},
{name:'鄂州', areaList:['请选择县','市辖区','梁子湖']},
{name:'孝感', areaList:['请选择县','市辖区','安陆','云梦','大悟','应城','汉川','孝昌']},
{name:'黄冈', areaList:['请选择县','市辖区','红安','麻城','罗田','英山','浠水','蕲春','黄梅','武穴','团风']},
{name:'黄石', areaList:['请选择县','市辖区','大冶','阳新','铁山','下陆','西塞山']},
{name:'咸宁', areaList:['请选择县','市辖区','赤壁','嘉鱼','崇阳','通城','通山']},
{name:'荆州', areaList:['请选择县','市辖区','江陵','公安','石首','监利','洪湖','松滋','沙市']},
{name:'宜昌', areaList:['请选择县','市辖区','远安','秭归','兴山','五峰','当阳','长阳','宜都','枝江','三峡','夷陵']},
{name:'恩施', areaList:['请选择县','市辖区','利川','建始','咸丰','宣恩','鹤峰','来凤','巴东']},
{name:'十堰', areaList:['请选择县','市辖区','竹溪','郧西','郧县','竹山','房县','丹江口','茅箭','张湾']},
{name:'神农架', areaList:['请选择县','市辖区']},
{name:'随州', areaList:['请选择县','市辖区','广水']},
{name:'荆门', areaList:['请选择县','市辖区','钟祥','京山','掇刀','沙洋']},
{name:'天门', areaList:['请选择县','市辖区']},
{name:'仙桃', areaList:['请选择县','市辖区']},
{name:'潜江', areaList:['请选择县','市辖区']}
]},
{name:'湖南', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'长沙', areaList:['请选择县','市辖区','宁乡','浏阳','马坡岭','望城']},
{name:'湘潭', areaList:['请选择县','市辖区','韶山','湘乡']},
{name:'株洲', areaList:['请选择县','市辖区','攸县','醴陵','茶陵','炎陵']},
{name:'衡阳', areaList:['请选择县','市辖区','衡山','衡东','祁东','衡阳县','常宁','衡南','耒阳','南岳']},
{name:'郴州', areaList:['请选择县','市辖区','桂阳','嘉禾','宜章','临武','资兴','汝城','安仁','永兴','桂东','苏仙']},
{name:'常德', areaList:['请选择县','市辖区','安乡','桃源','汉寿','澧县','临澧','石门','津市']},
{name:'益阳', areaList:['请选择县','市辖区','赫山区','南县','桃江','安化','沅江']},
{name:'娄底', areaList:['请选择县','市辖区','双峰','冷水江','新化','涟源']},
{name:'邵阳', areaList:['请选择县','市辖区','隆回','洞口','新邵','邵东','绥宁','新宁','武冈','城步','邵阳县']},
{name:'岳阳', areaList:['请选择县','市辖区','华容','湘阴','汨罗','平江','临湘']},
{name:'张家界', areaList:['请选择县','市辖区','桑植','慈利','武陵源']},
{name:'怀化', areaList:['请选择县','市辖区','沅陵','辰溪','靖州','会同','通道','麻阳','新晃','芷江','溆浦','中方','洪江']},
{name:'永州', areaList:['请选择县','市辖区','祁阳','东安','双牌','道县','宁远','江永','蓝山','新田','江华','冷水滩']},
{name:'湘西', areaList:['请选择县','吉首','保靖','永顺','古丈','凤凰','泸溪','龙山','花垣']}
]},
{name:'广东', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'广州', areaList:['请选择县','市辖区','番禺','从化','增城','花都']},
{name:'韶关', areaList:['请选择县','市辖区','乳源','始兴','翁源','乐昌','仁化','南雄','新丰','曲江','浈江','武江']},
{name:'惠州', areaList:['请选择县','市辖区','博罗','惠阳','惠东','龙门']},
{name:'梅州', areaList:['请选择县','市辖区','兴宁','蕉岭','大埔','丰顺','平远','五华','梅县']},
{name:'汕头', areaList:['请选择县','市辖区','潮阳','澄海','南澳']},
{name:'深圳', areaList:['请选择县','市辖区']},
{name:'珠海', areaList:['请选择县','市辖区','斗门','金湾']},
{name:'佛山', areaList:['请选择县','市辖区','顺德','三水','南海','高明']},
{name:'肇庆', areaList:['请选择县','市辖区','广宁','四会','德庆','怀集','封开','高要']},
{name:'湛江', areaList:['请选择县','市辖区','吴川','雷州','徐闻','廉江','赤坎','遂溪','坡头','霞山','麻章']},
{name:'江门', areaList:['请选择县','市辖区','开平','新会','恩平','台山','蓬江','鹤山','江海']},
{name:'河源', areaList:['请选择县','市辖区','紫金','连平','和平','龙川','东源']},
{name:'清远', areaList:['请选择县','市辖区','连南','连州','连山','阳山','佛冈','英德','清新']},
{name:'云浮', areaList:['请选择县','市辖区','罗定','新兴','郁南','云安']},
{name:'潮州', areaList:['请选择县','市辖区','饶平','潮安']},
{name:'东莞', areaList:['请选择县','市辖区']},
{name:'中山', areaList:['请选择县','市辖区']},
{name:'阳江', areaList:['请选择县','市辖区','阳春','阳东','阳西']},
{name:'揭阳', areaList:['请选择县','市辖区','揭西','普宁','惠来','揭东']},
{name:'茂名', areaList:['请选择县','市辖区','高州','化州','电白','信宜','茂港']},
{name:'汕尾', areaList:['请选择县','市辖区','海丰','陆丰','陆河']}
]},
{name:'广西', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'南宁', areaList:['请选择县','市辖区','邕宁','横县','隆安','马山','上林','武鸣','宾阳']},
{name:'崇左', areaList:['请选择县','市辖区','天等','龙州','凭祥','大新','扶绥','宁明']},
{name:'柳州', areaList:['请选择县','市辖区','柳城','鹿寨','柳江','融安','融水','三江']},
{name:'来宾', areaList:['请选择县','市辖区','忻城','金秀','象州','武宣','合山']},
{name:'桂林', areaList:['请选择县','市辖区','龙胜','永福','临桂','兴安','灵川','全州','灌阳','阳朔','恭城','平乐','荔浦','资源']},
{name:'梧州', areaList:['请选择县','市辖区','藤县','苍梧','蒙山','岑溪']},
{name:'贺州', areaList:['请选择县','市辖区','昭平','富川','钟山']},
{name:'贵港', areaList:['请选择县','市辖区','桂平','平南']},
{name:'玉林', areaList:['请选择县','市辖区','博白','北流','容县','陆川','兴业']},
{name:'百色', areaList:['请选择县','市辖区','那坡','田阳','德保','靖西','田东','平果','隆林','西林','乐业','凌云','田林']},
{name:'钦州', areaList:['请选择县','市辖区','浦北','灵山']},
{name:'河池', areaList:['请选择县','市辖区','天峨','东兰','巴马','环江','罗城','宜州','凤山','南丹','都安','大化']},
{name:'北海', areaList:['请选择县','市辖区','合浦','涠洲岛']},
{name:'防城港', areaList:['请选择县','市辖区','上思','东兴','防城']}
]},
{name:'海南', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'海口', areaList:['请选择县','市辖区']},
{name:'三亚', areaList:['请选择县','市辖区']},
{name:'东方', areaList:['请选择县','市辖区']},
{name:'临高', areaList:['请选择县','市辖区']},
{name:'澄迈', areaList:['请选择县','市辖区']},
{name:'儋州', areaList:['请选择县','市辖区']},
{name:'昌江', areaList:['请选择县','市辖区']},
{name:'白沙', areaList:['请选择县','市辖区']},
{name:'琼中', areaList:['请选择县','市辖区']},
{name:'定安', areaList:['请选择县','市辖区']},
{name:'屯昌', areaList:['请选择县','市辖区']},
{name:'琼海', areaList:['请选择县','市辖区']},
{name:'文昌', areaList:['请选择县','市辖区']},
{name:'保亭', areaList:['请选择县','市辖区']},
{name:'万宁', areaList:['请选择县','市辖区']},
{name:'陵水', areaList:['请选择县','市辖区']},
{name:'西沙', areaList:['请选择县','市辖区']},
{name:'南沙', areaList:['请选择县','市辖区']},
{name:'乐东', areaList:['请选择县','市辖区']},
{name:'五指山', areaList:['请选择县','市辖区']},
{name:'中沙', areaList:['请选择县','市辖区']}
]},
{name:'贵州', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'贵阳', areaList:['请选择县','市辖区','白云','花溪','乌当','息烽','开阳','修文','清镇','小河','云岩','南明']},
{name:'遵义', areaList:['请选择县','市辖区','遵义县','仁怀','绥阳','湄潭','凤冈','桐梓','赤水','习水','道真','正安','务川','余庆','汇川','红花岗']},
{name:'安顺', areaList:['请选择县','市辖区','普定','镇宁','平坝','紫云','关岭']},
{name:'黔南', areaList:['请选择县','都匀','贵定','瓮安','长顺','福泉','惠水','龙里','罗甸','平塘','独山','三都','荔波']},
{name:'黔东南', areaList:['请选择县','凯里','岑巩','施秉','镇远','黄平','麻江','丹寨','三穗','台江','剑河','雷山','黎平','天柱','锦屏','榕江','从江']},
{name:'铜仁', areaList:['请选择县','市辖区','江口','玉屏','万山','思南','印江','石阡','沿河','德江','松桃']},
{name:'毕节', areaList:['请选择县','市辖区','赫章','金沙','威宁','大方','纳雍','织金','黔西']},
{name:'六盘水', areaList:['请选择县','水城','六枝','盘县']},
{name:'黔西南', areaList:['请选择县','兴义','晴隆','兴仁','贞丰','望谟','安龙','册亨','普安']}
]},
{name:'云南', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'昆明', areaList:['请选择县','市辖区','东川','寻甸','晋宁','宜良','石林','呈贡','富民','嵩明','禄劝','安宁','太华山']},
{name:'大理', areaList:['请选择县','市辖区','云龙','漾濞','永平','宾川','弥渡','祥云','巍山','剑川','洱源','鹤庆','南涧']},
{name:'红河', areaList:['请选择县','市辖区','石屏','建水','弥勒','元阳','绿春','开远','个旧','蒙自','屏边','泸西','金平','河口']},
{name:'曲靖', areaList:['请选择县','市辖区','沾益','陆良','富源','马龙','师宗','罗平','会泽','宣威']},
{name:'保山', areaList:['请选择县','市辖区','龙陵','施甸','昌宁','腾冲']},
{name:'文山', areaList:['请选择县','市辖区','西畴','马关','麻栗坡','砚山','丘北','广南','富宁']},
{name:'玉溪', areaList:['请选择县','市辖区','澄江','江川','通海','华宁','新平','易门','峨山','元江']},
{name:'楚雄', areaList:['请选择县','市辖区','大姚','元谋','姚安','牟定','南华','武定','禄丰','双柏','永仁']},
{name:'普洱', areaList:['请选择县','市辖区','景谷','景东','澜沧','墨江','江城','孟连','西盟','镇沅','宁洱']},
{name:'昭通', areaList:['请选择县','市辖区','鲁甸','彝良','镇雄','威信','巧家','绥江','永善','盐津','大关','水富']},
{name:'临沧', areaList:['请选择县','市辖区','沧源','耿马','双江','凤庆','永德','云县','镇康']},
{name:'怒江', areaList:['请选择县','市辖区','福贡','兰坪','泸水','六库','贡山']},
{name:'迪庆', areaList:['请选择县','香格里拉','德钦','维西','中甸']},
{name:'丽江', areaList:['请选择县','市辖区','永胜','华坪','宁蒗']},
{name:'德宏', areaList:['请选择县','市辖区','陇川','盈江','瑞丽','梁河','芒市']},
{name:'西双版纳', areaList:['请选择县','景洪','勐海','勐腊']}
]},
{name:'四川', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'成都', areaList:['请选择县','市辖区','龙泉驿','新都','温江','金堂','双流','郫县','大邑','蒲江','新津','都江堰','彭州','邛崃','崇州','青白江区']},
{name:'攀枝花', areaList:['请选择县','市辖区','仁和','米易','盐边']},
{name:'自贡', areaList:['请选择县','市辖区','富顺','荣县']},
{name:'绵阳', areaList:['请选择县','市辖区','三台','盐亭','安县','梓潼','北川','平武','江油']},
{name:'南充', areaList:['请选择县','市辖区','南部','营山','蓬安','仪陇','西充','阆中']},
{name:'达州', areaList:['请选择县','市辖区','宣汉','开江','大竹','渠县','万源','通川','达县']},
{name:'遂宁', areaList:['请选择县','市辖区','蓬溪','射洪']},
{name:'广安', areaList:['请选择县','市辖区','岳池','武胜','邻水','华蓥']},
{name:'巴中', areaList:['请选择县','市辖区','通江','南江','平昌']},
{name:'泸州', areaList:['请选择县','市辖区','泸县','合江','叙永','古蔺','纳溪']},
{name:'宜宾', areaList:['请选择县','市辖区','宜宾县','南溪','江安','长宁','高县','珙县','筠连','兴文','屏山']},
{name:'内江', areaList:['请选择县','市辖区','东兴','威远','资中','隆昌']},
{name:'资阳', areaList:['请选择县','市辖区','安岳','乐至','简阳']},
{name:'乐山', areaList:['请选择县','市辖区','犍为','井研','夹江','沐川','峨边','马边','峨眉','峨眉山']},
{name:'眉山', areaList:['请选择县','市辖区','仁寿','彭山','洪雅','丹棱','青神']},
{name:'凉山', areaList:['请选择县','市辖区','木里','盐源','德昌','会理','会东','宁南','普格','西昌','金阳','昭觉','喜德','冕宁','越西','甘洛','雷波','美姑','布拖']},
{name:'雅安', areaList:['请选择县','市辖区','名山','荥经','汉源','石棉','天全','芦山','宝兴']},
{name:'甘孜', areaList:['请选择县','市辖区','康定','泸定','丹巴','九龙','雅江','道孚','炉霍','新龙','德格','白玉','石渠','色达','理塘','巴塘','乡城','稻城','得荣']},
{name:'阿坝', areaList:['请选择县','市辖区','汶川','理县','茂县','松潘','九寨沟','金川','小金','黑水','马尔康','壤塘','若尔盖','红原']},
{name:'德阳', areaList:['请选择县','市辖区','中江','广汉','什邡','绵竹','罗江']},
{name:'广元', areaList:['请选择县','市辖区','旺苍','青川','剑阁','苍溪']}
]},
{name:'西藏', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'拉萨', areaList:['请选择县','市辖区','当雄','尼木','林周','堆龙德庆','曲水','达孜','墨竹工卡']},
{name:'日喀则', areaList:['请选择县','市辖区','拉孜','南木林','聂拉木','定日','江孜','帕里','仲巴','萨嘎','吉隆','昂仁','定结','萨迦','谢通门','岗巴','白朗','亚东','康马','仁布']},
{name:'山南', areaList:['请选择县','市辖区','贡嘎','札囊','加查','浪卡子','错那','隆子','泽当','乃东','桑日','洛扎','措美','琼结','曲松']},
{name:'林芝', areaList:['请选择县','市辖区','波密','米林','察隅','工布江达','朗县','墨脱']},
{name:'昌都', areaList:['请选择县','市辖区','丁青','边坝','洛隆','左贡','芒康','类乌齐','八宿','江达','察雅','贡觉']},
{name:'那曲', areaList:['请选择县','市辖区','尼玛','嘉黎','班戈','安多','索县','聂荣','巴青','比如','双湖']},
{name:'阿里', areaList:['请选择县','市辖区','改则','申扎','狮泉河','普兰','札达','噶尔','日土','革吉','措勤']}
]},
{name:'陕西', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'西安', areaList:['请选择县','市辖区','长安','临潼','蓝田','周至','户县','高陵']},
{name:'咸阳', areaList:['请选择县','市辖区','三原','礼泉','永寿','淳化','泾阳','武功','乾县','彬县','长武','旬邑','兴平']},
{name:'延安', areaList:['请选择县','市辖区','延长','延川','子长','宜川','富县','志丹','安塞','甘泉','洛川','黄陵','黄龙','吴起']},
{name:'榆林', areaList:['请选择县','市辖区','府谷','神木','佳县','定边','靖边','横山','米脂','子洲','绥德','吴堡','清涧','榆阳']},
{name:'渭南', areaList:['请选择县','市辖区','华县','潼关','大荔','白水','富平','蒲城','澄城','合阳','韩城','华阴']},
{name:'商洛', areaList:['请选择县','市辖区','洛南','柞水','商州','镇安','丹凤','商南','山阳']},
{name:'安康', areaList:['请选择县','市辖区','紫阳','石泉','汉阴','旬阳','岚皋','平利','白河','镇坪','宁陕']},
{name:'汉中', areaList:['请选择县','市辖区','略阳','勉县','留坝','洋县','城固','西乡','佛坪','宁强','南郑','镇巴']},
{name:'宝鸡', areaList:['请选择县','市辖区','千阳','麟游','岐山','凤翔','扶风','眉县','太白','凤县','陇县','陈仓']},
{name:'铜川', areaList:['请选择县','市辖区','耀县','宜君','耀州']},
{name:'杨凌', areaList:['请选择县','市辖区']}
]},
{name:'宁夏', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'银川', areaList:['请选择县','市辖区','永宁','灵武','贺兰']},
{name:'石嘴山', areaList:['请选择县','市辖区','惠农','平罗','陶乐']},
{name:'吴忠', areaList:['请选择县','市辖区','同心','盐池','青铜峡']},
{name:'固原', areaList:['请选择县','市辖区','西吉','隆德','泾源','彭阳']},
{name:'中卫', areaList:['请选择县','市辖区','中宁','海原']}
]},
{name:'甘肃', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'兰州', areaList:['请选择县','市辖区','皋兰','永登','榆中']},
{name:'定西', areaList:['请选择县','市辖区','通渭','陇西','渭源','临洮','漳县','岷县','安定']},
{name:'平凉', areaList:['请选择县','市辖区','泾川','灵台','崇信','华亭','庄浪','静宁','崆峒']},
{name:'庆阳', areaList:['请选择县','市辖区','西峰','环县','华池','合水','正宁','宁县','镇原','庆城']},
{name:'武威', areaList:['请选择县','市辖区','民勤','古浪','天祝']},
{name:'金昌', areaList:['请选择县','市辖区','永昌']},
{name:'张掖', areaList:['请选择县','市辖区','肃南','民乐','临泽','高台','山丹']},
{name:'酒泉', areaList:['请选择县','市辖区','金塔','阿克塞','瓜州','肃北','玉门','敦煌']},
{name:'天水', areaList:['请选择县','市辖区','清水','秦安','甘谷','武山','张家川','麦积']},
{name:'陇南', areaList:['请选择县','武都','成县','文县','宕昌','康县','西和','礼县','徽县','两当']},
{name:'临夏', areaList:['请选择县','市辖区','康乐','永靖','广河','和政','东乡','积石山']},
{name:'甘南', areaList:['请选择县','合作','临潭','卓尼','舟曲','迭部','玛曲','碌曲','夏河']},
{name:'白银', areaList:['请选择县','市辖区','靖远','会宁','平川','景泰']},
{name:'嘉峪关', areaList:['请选择县','市辖区']}
]},
{name:'青海', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'西宁', areaList:['请选择县','市辖区','大通','湟源','湟中']},
{name:'海东', areaList:['请选择县','市辖区','乐都','民和','互助','化隆','循化','冷湖','平安']},
{name:'黄南', areaList:['请选择县','市辖区','尖扎','泽库','河南','同仁']},
{name:'海南', areaList:['请选择县','市辖区','贵德','兴海','贵南','同德','共和']},
{name:'果洛', areaList:['请选择县','市辖区','班玛','甘德','达日','久治','玛多','多县','玛沁']},
{name:'玉树', areaList:['请选择县','市辖区','称多','治多','杂多','囊谦','曲麻莱']},
{name:'海西', areaList:['请选择县','市辖区','天峻','乌兰','茫崖','大柴旦','德令哈']},
{name:'海北', areaList:['请选择县','市辖区','门源','祁连','海晏','刚察']},
{name:'格尔木', areaList:['请选择县','市辖区','都兰']}
]},
{name:'新疆', cityList:[
{name:'请选择市', areaList:['请选择县']},
{name:'乌鲁木齐', areaList:['请选择县','市辖区','小渠子','达坂城','乌鲁木齐牧试站','天池','白杨沟']},
{name:'克拉玛依', areaList:['请选择县','市辖区','乌尔禾','白碱滩']},
{name:'石河子', areaList:['请选择县','市辖区','炮台','莫索湾']},
{name:'昌吉', areaList:['请选择县','市辖区','呼图壁','米泉','阜康','吉木萨尔','奇台','玛纳斯','木垒','蔡家湖']},
{name:'吐鲁番', areaList:['请选择县','市辖区','托克逊','鄯善']},
{name:'巴音郭楞', areaList:['请选择县','库尔勒','轮台','尉犁','若羌','且末','和静','焉耆','和硕','巴音布鲁克','铁干里克','博湖','塔中','巴仑台']},
{name:'阿拉尔', areaList:['请选择县','市辖区']},
{name:'阿克苏', areaList:['请选择县','市辖区','乌什','温宿','拜城','新和','沙雅','库车','柯坪','阿瓦提']},
{name:'喀什', areaList:['请选择县','市辖区','英吉沙','塔什库尔干','麦盖提','莎车','叶城','泽普','巴楚','岳普湖','伽师','疏附','疏勒']},
{name:'伊犁', areaList:['请选择县','伊宁','察布查尔','尼勒克','伊宁县','巩留','新源','昭苏','特克斯','霍城','霍尔果斯','奎屯']},
{name:'塔城', areaList:['请选择县','市辖区','裕民','额敏','和布克赛尔','托里','乌苏','沙湾']},
{name:'哈密', areaList:['请选择县','市辖区','巴里坤','伊吾']},
{name:'和田', areaList:['请选择县','市辖区','皮山','策勒','墨玉','洛浦','民丰','于田']},
{name:'阿勒泰', areaList:['请选择县','市辖区','哈巴河','吉木乃','布尔津','福海','富蕴','青河']},
{name:'克州', areaList:['请选择县','阿图什','乌恰','阿克陶','阿合奇']},
{name:'博尔塔拉', areaList:['请选择县','博乐','温泉','精河','阿拉山口']}
]}
];